package com.learn.dataStructure.D7Graph;

/**
 * @author yds
 * @title: Friends
 * @description: TODO
 * @date 2020/12/7 15:28
 */
public class Friends {
    //    给定一个 N * N 的矩阵 M，表示班级中学生之间的朋友关系。
//    如果M[i][j] = 1，表示已知第 i 个和 j 个学生互为朋友关系，否则为不知道。
//    你必须输出所有学生中的已知的朋友圈总数。

//    示例 1:
//        输入: [[1,1,0], [1,1,0], [0,0,1]]
//        输出: 2
//        说明：已知学生0和学生1互为朋友，他们在一个朋友圈。 第2个学生自己在一个朋友圈。所以返回2。
//
//
//    示例 2:
//        输入: [[1,1,0], [1,1,1], [0,1,1]]
//        输出: 1
//        说明：已知学生0和学生1互为朋友，学生1和学生2互为朋友，所以学生0和学生2也是朋友，所以他们三个在一个朋友圈，返回1。
//
}
